_org_posts/_posts/2022-01-01-boj-1339.org
#+HTML: ---
#+HTML: title: BOJ 1339 단어 수학
#+HTML: tags: 그리디
#+HTML: ---
#+OPTIONS: ^:nil

** BOJ 1339 단어 수학
- 그리디 방법으로 문제의 성질을 파악하는 문제

** 접근하기
#+BEGIN_EXAMPLE
  GCF
ACDEB

A = 10000               // 10000의 자리에 A가 나옴
C = 1010  = 1000 + 10   // 1000의 자리, 10의 자리에 한번씩 나옴
D = 100
G = 100
E = 10
F = 1
B = 1

이렇게 자릿수를 표현하고 정렬하면

10000 1010 100 100  10   1   1
  A    C    D   G    E   F   B
  9    8    7   6    5   4   3 <- 9부터 차례로 매핑

98753
  684
-----
99437
#+END_EXAMPLE


** 코드
#+BEGIN_SRC cpp
#include <bits/stdc++.h>
using namespace std;

int N;
char str[10];
typedef long long ll;

long long pow10(int n)
{
    long long ans = 1; 
    for(int i=1;i<=n;i++) {
        ans *= 10;
    }
    return ans;
}

int main(int argc, char* argv[])
{
    //freopen("input.txt", "r", stdin);
    //freopen("input3.txt", "r", stdin);
    freopen("input4.txt", "r", stdin);
    //freopen("input2.txt", "r", stdin);
    scanf("%d", &N);
    ll table[26] = {0};

    ll result = 0;
    for(int i=0;i<N;i++) {
        scanf("%s", str);

        int len = 0;
        for(;str[len];len++);

        for(int j=0;j<len;j++) {
            int idx = str[j] - 'A';
            table[idx] += pow10(len-j-1);
        }

    }
    sort(table, table+26);
    int cnt = 9;
    for(int i=25;i>=0;i--) {
        if (table[i] == 0) break;
        result += (table[i] * cnt--);
    }
    printf("%lld\n", result);
    return 0;
}
#+END_SRC

** 문제 링크
- https://www.acmicpc.net/problem/1339

** 풀이참고
- https://pskpsk.tistory.com/entry/%EB%B0%B1%EC%A4%801339-%EB%8B%A8%EC%96%B4-%EC%88%98%ED%95%99
- https://mygumi.tistory.com/156
